/*===============================================================
 * Copyright (C) . All rights reserved.")"
 * 文件名称：default (缺省)
 * 创 建 者: yangjie
 * 创建日期: 2020.1.14
 * 描    述: 这个demo描述函数参数缺省的情况以及打印函数参数的值
 *           缺省参数是声明或定义函数时为函数的参数指定的一个默认值
 * =============================================================*/

#include <iostream>
using namespace std;

// 半缺省参数: 部分参数带有缺省值
// 规则: 1. 半缺省参数必须从右往左一次给出, 不能间隔着给
//       2. 缺省参数不能在函数声明和定义中同时出现
//       3. 缺省值必须是常量或者全局变量
//       4. c语言不支持 (编译器不支持)
void TestFunc (int a , int b = 1 , int c = 2)
{
  cout << a << " " << b << " " << c << endl;
}

int main()
{
  TestFunc(100);
  TestFunc(100, 200);
  TestFunc(100, 200, 300);
  return 0;
}
